import { apiSlice } from "../../../app/api/apiSlice";

/*
=========================================================
Users API
---------------------------------------------------------
تمام درخواست‌های مربوط به کاربران در این فایل قرار می‌گیرد.
از این به بعد به جای userService.js کم‌کم از RTK Query
استفاده خواهیم کرد.
=========================================================
*/

export const usersApi = apiSlice.injectEndpoints({

    endpoints: (builder) => ({

        /*
        =========================================================
        دریافت لیست کاربران
        =========================================================
        */

        getUsers: builder.query({

            // آدرس API
            query: () => "/Users",

        }),

    }),

});

// هوک آماده‌ای که RTK Query برای React می‌سازد
export const {
    useGetUsersQuery,
} = usersApi;